** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.34.leval.scm")
  ;; Test
  (map (lambda (x)
         (print x)
         (mc-print (list x))
         (mc-eval `(car ,x))
         (mc-print (list x))
         (mc-eval `(list-ref ,x 10))
         (mc-print (list x))
         (newline))
       '(ones integers fibs))
#+end_src

#+RESULTS:
#+begin_example
ones
{... ...}
{1 ...}
{1 {1 ...}}

integers
{... ...}
{1 ...}
{1 {2 {3 {4 {5 {6 {7 {8 {9 {10 {11 ...}}}}}}}}}}}

fibs
{... ...}
{0 ...}
{0 {1 {1 {2 {3 {5 {8 {13 {21 {34 {55 ...}}}}}}}}}}}

#+end_example
